[
  {
    "id": 1,
    "title": "CALL FOR APPLICATION TO THE SEARCH FOR PRESIDENT OF ISPSC.",
    "date": "Nov 20, 2023",
    "img": "https://ispsc.edu.ph/images/whatsnew/thumb/searchispscpres2.jpg",
    "content": "The ISPSC Board of Trustees is now opening the search and call for applications for the next ISPSC President.  Interested applicants must meet the minimum requirements and submit pertinent supporting documentary evidences for these minimum qualifications on or before December 1, 2023 at 5:00 PM (Philippine Standard Time). "
  },
  {
    "id": 2,
    "title": "Publication of Vacant Positions.",
    "date": "Nov 20, 2023",
    "img": "https://ispsc.edu.ph/images/misc/logo.png",
    "content": "We are looking for qualified applicants for various non-teaching positions. "
  },
  {
    "id": 3,
    "title": "ISPSC hosts IRCET 2023.",
    "date": "Sep 15, 2023",
    "img": "https://ispsc.edu.ph/images/whatsnew/thumb/ircet2023.png",
    "content": "Research is fully embraced by every higher education institution as one of the mandates it has to perform. Ilocos Sur Polytechnic State College (ISPSC) and Abra State Institute of Sciences and Technology (ASIST) perform this mandate and commit to imbibing the culture of research for educational transformation and development."
  },
  {
    "id": 4,
    "title": "Back-to-Back Win! ISPSC’s bet crowned Ms. ASCU-SN 2023.",
    "date": "Jul 05, 2023",
    "img": "https://ispsc.edu.ph/images/whatsnew/thumb/msascu-backtoback.jpg",
    "content": "In a stunning demonstration of agility, intellect, and resilience, Miss Delrio Dumawa, an enthusiastic faculty member from Ilocos Sur Polytechnic State College-Main Campus, emerged victorious as Ms. ASCU-SN 2023 during the Search for Mr.  & Ms. ASCU-SN 2023 held at Tarlac Agricultural University on June 28, 2023."
  },
  {
    "id": 5,
    "title": "ISPSC ranks in 2023 Global Top Innovative Universities.",
    "date": "May 19, 2023",
    "img": "https://ispsc.edu.ph/images/whatsnew/thumb/wurismall.jpg",
    "content": "With its innovative programs on student mobility and openness, crisis management, and the fourth industrial revolution, the Ilocos Sur Polytechnic State College (ISPSC) was ranked as one of the Global Top Innovative Universities in the May 2023 ranking of The World University Rankings for Innovation (WURI)."
  },
  {
    "id": 6,
    "title": "ISPSC undergoes re-certification for Quality Management System.",
    "date": "May 11, 2023",
    "img": "https://ispsc.edu.ph/images/whatsnew/thumb/recertification.jpg",
    "content": "The Ilocos Sur Polytechnic State College (ISPSC) underwent re-certification for Quality Management System by SOCOTEC International on May 9-10, 2023."
  }

]
